# Script Assignment 6 - Group 1
#### Marco Bogani, Daman Sawhney, Sulaiman Karmali, Ivan Lima, Zach Novak

In Financial Technology (FinTech), anomaly detection plays a crucial role in identifying fraudulent activities such as money laundering or unauthorized transactions. One popular method for anomaly detection is DBSCAN (Density-Based Spatial Clustering of Applications with Noise), which effectively identifies clusters of data points that are closely packed together while marking outliers as noise. In this assignment, you are tasked with implementing a Python script to detect anomalous transactions in financial data using DBSCAN.

Instructions:
1. Download the provided financial transaction datasetLinks to an external site.. Links to an external site.Preprocess the data if necessary (e.g., normalization, feature engineering). (5 points)

2. Implement the DBSCAN algorithm using the scikit-learn library. Tune the hyperparameters such as epsilon (eps) and minimum samples (min_samples) to achieve optimal performance. Cluster the transactions using DBSCAN.  (10 points)

3. Identify anomalous transactions as outliers detected by DBSCAN. Analyze the characteristics of these anomalies to understand their nature. Visualize the clusters and outliers for better insights.  (5 points)

Import Libraries

In [31]:
import pandas as pd

Read in xlsx file into a dataframe.

In [32]:
df = pd.read_excel(r"C:\Users\Setup User\Downloads\bank.xlsx")

In [33]:
df.head()

,Account No,DATE,TRANSACTION DETAILS,CHQ.NO.,VALUE DATE,WITHDRAWAL AMT,DEPOSIT AMT,BALANCE AMT,.
0,409000611074',2017-06-29,TRF FROM Indiaforensic SERVICES,NaN,2017-06-29,NaN,1000000.00,1000000.00,.
1,409000611074',2017-07-05,TRF FROM Indiaforensic SERVICES,NaN,2017-07-05,NaN,1000000.00,2000000.00,.
2,409000611074',2017-07-18,FDRL/INTERNAL FUND TRANSFE,NaN,2017-07-18,NaN,500000.00,2500000.00,.
3,409000611074',2017-08-01,TRF FRM Indiaforensic SERVICES,NaN,2017-08-01,NaN,3000000.00,5500000.00,.
4,409000611074',2017-08-16,FDRL/INTERNAL FUND TRANSFE,NaN,2017-08-16,NaN,500000.00,6000000.00,.

In [34]:
column_names = pd.DataFrame(df.columns)
column_names

                     0
0           Account No
1                 DATE
2  TRANSACTION DETAILS
3              CHQ.NO.
4           VALUE DATE
5       WITHDRAWAL AMT
6          DEPOSIT AMT
7          BALANCE AMT
8                    .

In [35]:
df.info()  # to get the information about the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 116201 entries, 0 to 116200
Data columns (total 9 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   Account No           116201 non-null  object
 1   DATE                 116201 non-null  datetime64[ns]
 2   TRANSACTION DETAILS  113702 non-null  object
 3   CHQ.NO.              905 non-null     float64
 4   VALUE DATE           116201 non-null  datetime64[ns]
 5   WITHDRAWAL AMT       53549 non-null   float64
 6   DEPOSIT AMT          62652 non-null   float64
 7   BALANCE AMT          116201 non-null  float64
 8   .                    116201 non-null  object
dtypes: datetime64[ns](2), float64(4), object(3)
memory usage: 8.0+ MB

In [36]:
nacount = df.isna().sum()
nacount

Account No                  0
DATE                        0
TRANSACTION DETAILS      2499
CHQ.NO.                115296
VALUE DATE                  0
WITHDRAWAL AMT          62652
DEPOSIT AMT             53549
BALANCE AMT                 0
.                           0
dtype: int64

In [37]:
pd.options.display.float_format = '{:.2f}'.format
descdf = df.describe()
descdf = descdf.drop(['DATE', 'VALUE DATE'], axis=1)
descdf

        CHQ.NO.  WITHDRAWAL AMT  DEPOSIT AMT    BALANCE AMT
count    905.00        53549.00     62652.00      116201.00
mean  791614.50      4489189.94   3806585.83 -1404852040.95
min        1.00            0.01         0.01 -2045201141.91
25%   704231.00         3000.00     99000.00 -1690383401.95
50%   873812.00        47083.00    426500.00 -1661395376.39
75%   874167.00      5000000.00   4746411.45 -1236888423.43
max   874525.00    459447546.36 544800000.00     8500000.00
std   151205.93     10848504.20   8683093.41   534820182.35

Now that we know the data. Pre-processing can begin.

NA values must be dropped or filled.

Empty DataFrame
Columns: [Account No, DATE, TRANSACTION DETAILS, CHQ.NO., VALUE DATE, WITHDRAWAL AMT, DEPOSIT AMT, BALANCE AMT, .]
Index: []
The new shape of the data is:  (0, 9)